<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="style.css">
    <title>С 23-м февраля!</title>
</head>

<header>
<div class = "header">
<br></br>
<br></br>
<br></br>
<br></br>
<br></br>
<br></br>
<br></br>
<br></br>
<br></br>
<br></br>
<br></br>
<br></br>
<br></br>
<br></br>
</header>
<br>
<body>
<div class = "block_1">
    <img src = "IMG/pic_1.png">23 февраля в России отмечается День защитника Отечества, являющейся днем воинской славы страны.
Праздник зародился еще в СССР; тогда 23 февраля ежегодно отмечался как всенародный праздник – День Советской Армии и Военно-Морского Флота.
Документа, учреждавшего 23 февраля как официальный советский праздник, не существовало. Советская историография связывала приурочивание чествования военных к этой дате с событиями 1918 года: 28 января (15 января по старому стилю) 1918 года Совет народных комиссаров (СНК) во главе с председателем Владимиром Лениным принял Декрет об организации Рабоче-Крестьянской Красной Армии (РККА), а 11 февраля (29 января по старому стилю) – Рабоче-Крестьянского Красного Флота (РККФ).
</div>
<br>
<div class = "block_1">
    <img src = "IMG/pic_2.png"> В обстановке наступления войск германского империализма на Советскую Россию 22 февраля был опубликован декрет-воззвание СНК "Социалистическое Отечество в опасности!" (принят 21 февраля), а 23 февраля состоялись массовые митинги в Петрограде (ныне Санкт-Петербург), Москве и других городах страны, на которых трудящихся призывали встать на защиту своего Отечества от наступавших германских войск. Этот день ознаменовался массовым вступлением добровольцев в Красную Армию и началом формирования ее отрядов и частей.
</div>
<br>
<div class = "block_1">
    <img src = "IMG/pic_3.png">10 января 1919 года председатель Высшей военной инспекции РККА Николай Подвойский направил в президиум Всероссийского центрального исполнительного комитета (ВЦИК) предложение отпраздновать годовщину создания Красной Армии, приурочив торжество к ближайшему воскресенью до или после 28 января. Однако из-за позднего предоставления ходатайства решение не было принято.
Тогда инициативу празднования первой годовщины РККА взял на себя Моссовет. 24 января 1919 года его президиум, возглавляемый Львом Каменевым, постановил приурочить эти торжества ко дню Красного подарка, проводимого с целью сбора материальных и денежных средств для Красной Армии. При ВЦИК был создан Центральный комитет по организации празднования годовщины Красной Армии и дня Красного подарка, который назначил проведение торжеств на воскресенье 23 февраля. 5 февраля 1919 года "Правда" и другие газеты опубликовали сообщение: "Устройство дня Красного подарка по всей России перенесено на 23 февраля. В этот день по городам и на фронте будет организовано празднование годовщины создания Красной армии, исполнившейся 28 января".
</div>
<br>
<div class = "block_2">
    <img src = "IMG/pic_4.png">Ну, вообщем-то всё. С праздником. 
</div>

</body>
</html>